<template>
  <div>
    <article>
      <p>单是说不行，要紧的是做。</p>
      <p>在行进时，也时时有人退伍，有人落荒，有人颓唐，有人叛变，然而只要无碍于进行，则越到后来，这队伍也就越成为纯粹、精锐的队伍了。</p>
      <p>巨大的建筑，总是由一木一石叠起来的，我们何妨做做这一木一石呢？我时常做些零碎事，就是为此。</p>
      <p>改造自己，总比禁止别人来得难。</p>
    </article>
    <g-sticky :distance="58">
      <g-button>
        <g-icon name="fixed"></g-icon>我是粘滞按钮，请滑动鼠标滚轮
      </g-button>
    </g-sticky>
    <article>
      <p>友谊是两颗心的真诚相待，而不是一颗心对另一颗心的敲打。</p>
      <p>父母对于子女，应该健全的产生，尽力的教育，完全的解放。</p>
      <p>倘只看书，便变成书橱。</p>
      <p>愈艰难，就愈要做。改革，是向来没有一帆风顺的。</p>
      <p>必须敢于正视，这才可望敢想、敢说、敢做、敢当。</p>
      <p>其实先驱者本是容易变成绊脚石的。</p>
      <p>假使做事要面面顾到，那就什么事都不能做了。</p>
      <p>只要能培一朵花，就不妨做做会朽的腐草。</p>
      <p>怀疑并不是缺点。总是疑，而并不下断语，这才是缺点。</p>
      <p>以人为鉴，明白非常，是使人能够反省的妙法。</p>
      <p>使一个人的有限的生命，更加有效，也即等于延长了人的生命。</p>
      <p>自由固不是钱所买到的，但能够为钱而卖掉。</p>
      <p>愿中国青年都摆脱冷气，只是向上走，不必听自暴自弃者流的话。能做事的做事，能发声的发声。有一分热，发一分光。就令萤火一般，也可以在黑暗里发一点光，不必等候炬火。</p>
      <p>读书要眼到、口到、心到、手到、脑到。</p>
      <p>教育植根于爱。</p>
      <p>读书应自己思索，自己做主。</p>
      <p>有缺点的战士终究是战士，宝贵的苍蝇也终究不过是苍蝇。</p>
      <p>造化常为庸人设计。</p>
    </article>
  </div>
</template>
<script>
import Sticky from "../../../src/sticky";
import Icon from "../../../src/icon";
import Button from "../../../src/button/button";
export default {
  components: {
    "g-sticky": Sticky,
    "g-button": Button,
    "g-icon": Icon
  }
};
</script>
<style >
p{
  color:#555;
}
.icon {
  fill: #722ed1;
}
</style>


